app/controllers/aberrations_controller.rb

SELECT * FROM "aberrations"
---
  def index
    @aberrations = Aberration.all

SELECT * FROM "aberrations" WHERE ("aberrations"."id" = 1)
---
  def show
    @aberration = Aberration.find(params[:id])

INSERT INTO "aberrations" ("name", "created_at", "updated_at") VALUES('Epigenetic', '2010-06-29 18:24:05', '2010-06-29 18:24:05')
---
  def create
    @aberration = Aberration.new(params[:aberration])

    respond_to do |format|
      if @aberration.save