app/controllers/concepts_controller.rb

SELECT * FROM "concepts"
---
  def index
    @concepts = Concept.all

SELECT "members".* FROM "members" WHERE ("members".concept_id = 71900604)
SELECT "treatments".* FROM "treatments" WHERE ("treatments".concept_id = 71900604)
SELECT * FROM "concepts" WHERE ("concepts"."id" = 71900604)
SELECT * FROM "drugs" WHERE ("drugs"."id" IN (798966427,459036662,78778718))
---
  def show
    @flag = 'no'
    if Concept.exists?(params[:id])
    @flag = 'yes'
    @concept = Concept.find(params[:id], :include => [{:members => [:gene]}, {:treatments => [:drug]}])

SELECT * FROM "concepts" WHERE ("concepts"."id" = 439191579)
---
  def edit
    @concept = Concept.find(params[:id])

SELECT * FROM "concepts" WHERE ("concepts"."id" = 439191579)
UPDATE "concepts" SET "updated_at" = '2010-06-29 18:24:41', "orientation_id" = 1, "phenotype_id" = 1, "notes" = '', "aberration_id" = 1, "source_id" = 1, "description" = '' WHERE "id" = 439191579
---
  def update
    @concept = Concept.find(params[:id])

    respond_to do |format|
      if @concept.update_attributes(params[:concept])