app/controllers/drugs_controller.rb

  def index
    respond_to do |format|
      format.html {
		page = params[:page] || 1
	    @drugs = Drug.paginate(:include => [:source], :order => 'name ASC', :page => page, :per_page => 10)
---
SELECT * FROM "drugs" ORDER BY name ASC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "drugs"

  def show
    @drug = Drug.find(params[:id])
---
SELECT * FROM "drugs" WHERE ("drugs"."id" = 1060257813)