app/controllers/genes_controller.rb

SELECT * FROM "genes" WHERE ("genes"."id" = 217689638)
---
	def attempt_id_conversions
		if params[:id]
			@gene = Gene.find(params[:id])

SELECT * FROM "genes" ORDER BY hugo_id ASC
---
  def index
    @genes = Gene.all(:order => 'hugo_id ASC')