app/controllers/imports_controller.rb

SELECT * FROM "imports"
---
	def index
		@imports = Import.all

SELECT * FROM "imports" WHERE ("imports"."id" = 10103960)
---
	def show
		@import = Import.find(params[:id])

SELECT * FROM "imports" WHERE ("imports"."id" = 10103960)
---
	def edit
		@import = Import.find(params[:id])