app/controllers/orientations_controller.rb

  def index
    @orientations = Orientation.all
---
SELECT * FROM "orientations"

  def show
    @orientation = Orientation.find(params[:id])
---
SELECT * FROM "orientations" WHERE ("orientations"."id" = 1)

  def create
    @orientation = Orientation.new(params[:orientation])

    respond_to do |format|
      if @orientation.save
---
INSERT INTO "orientations" ("name", "created_at", "updated_at") VALUES('Up', '2010-06-29 18:23:16', '2010-06-29 18:23:16')