app/controllers/search_controller.rb

SELECT * FROM "sources" WHERE (name LIKE '%dr%' OR url LIKE '%dr%' OR description LIKE '%dr%') ORDER BY name ASC LIMIT 15
SELECT * FROM "drugs" WHERE (name LIKE '%dr%' OR generic_names LIKE '%dr%' OR brand_names LIKE '%dr%') LIMIT 15
SELECT count(*) AS count_all FROM "treatments" WHERE ("treatments".concept_id = 439191579)
SELECT * FROM "concepts" WHERE (name LIKE '%dr%' OR description LIKE '%dr%') ORDER BY name ASC LIMIT 15
SELECT * FROM "genes" WHERE (hugo_id LIKE '%dr%') ORDER BY hugo_id ASC LIMIT 15
---
	def live
		@phrase = params[:query]
		if !@phrase.nil? and @phrase.length >= 1
	 	   a1 = "%"
	 	   a2 = "%"
	 	   q = a1 + @phrase + a2
	 	   @limit = 15

			@sources = Source.find(:all, :conditions => [ "name LIKE ? OR url LIKE ? OR description LIKE ?", q, q, q], :limit => @limit, :order => 'name ASC')

	 	   	@drugs = Drug.find(:all, :conditions => [ "name LIKE ? OR generic_names LIKE ? OR brand_names LIKE ?", q, q, q], :limit => @limit)
			@drugs.sort! do |a, b| b.treatments.count <=> a.treatments.count end

     		@concepts = Concept.all(:conditions => ["name LIKE ? OR description LIKE ?", q, q], :limit => @limit, :order => 'name ASC')

			@genes = Gene.all(:conditions => ["hugo_id LIKE ?", q], :order => 'hugo_id ASC', :limit => @limit)