app/controllers/treatments_controller.rb

SELECT * FROM "treatments"
---
  def index
    @treatments = Treatment.all