app/controllers/uploads_controller.rb

  def show
    @upload = Upload.find(params[:id])
---
SELECT * FROM "uploads" WHERE ("uploads"."id" = 807296139)

  def create
    @upload = Upload.new(params[:upload])

    respond_to do |format|
      if @upload.save
---
INSERT INTO "uploads" ("created_at", "data_updated_at", "import_id", "updated_at", "data_content_type", "data_file_name", "data_file_size") VALUES('2010-06-30 16:02:28', '2010-06-30 16:02:28', 781471165, '2010-06-30 16:02:28', 'text/plain', 'drugcards.txt', 90109715)

  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy
---
SELECT * FROM "uploads" WHERE ("uploads"."id" = 807296139)
DELETE FROM "uploads" WHERE "id" = 807296139