app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
	@user.roles = Role.find(params[:role_ids]) if params[:role_ids]
---
SELECT * FROM "users" WHERE ("users"."id" = 1028376775) LIMIT 1
SELECT * FROM "roles" INNER JOIN "roles_users" ON "roles".id = "roles_users".role_id WHERE ("roles_users".user_id = 1028376775 )